Revit 2024 API
ExternalServices.BuiltInExternalServices.IFCExporterService Property
 The external service which permits registration of an alternate implementation for IFC export.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId IFCExporterService { get; }
Visual Basic
Public Shared ReadOnly Property IFCExporterService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ IFCExporterService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace